###############################################################
#  Generated by:      Cadence Encounter 13.13-s017_1
#  OS:                Linux x86_64(Host ID microelnsys)
#  Generated on:      Wed Oct 18 23:49:20 2017
#  Design:            DLX
#  Command:           saveDesign DLX.enc
###############################################################
current_design DLX
create_clock [get_ports {Clk}]  -name Clk -period 3.500000 -waveform {0.000000 1.750000}
set_propagated_clock  [get_ports {Clk}]
